      * ADDRREC  - ENTERPRISE STANDARD ADDRESS (5-CHAR POSTAL CODE)
           05  ADR-LINE1              PIC X(30).
           05  ADR-CITY               PIC X(20).
           05  ADR-STATE              PIC X(2).
           05  ADR-POSTAL             PIC X(5).
