      * DATEWS   - STANDARD DATE / TIME WORK AREA (16 BYTES)
           05  WS-CURR-DATE           PIC 9(8).
           05  WS-CURR-DATE-R         REDEFINES WS-CURR-DATE.
           10  WS-CURR-YYYY           PIC 9(4).
           10  WS-CURR-MM             PIC 99.
           10  WS-CURR-DD             PIC 99.
           05  WS-CURR-TIME           PIC 9(8).
