CUSTMS   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,      X
               CTRL=(FREEKB,FRSET),TIOAPFX=YES
CUSTMAP  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,30),LENGTH=16,ATTRB=(ASKIP,BRT),                X
               INITIAL='CUSTOMER INQUIRY'
         DFHMDF POS=(4,5),LENGTH=12,ATTRB=(ASKIP,NORM),                X
               INITIAL='CUSTOMER ID:'
CUSTID   DFHMDF POS=(4,20),LENGTH=8,ATTRB=(UNPROT,IC,FSET),PICIN='X(8)'
         DFHMDF POS=(6,5),LENGTH=12,ATTRB=(ASKIP,NORM),                X
               INITIAL='NAME       :'
CUSTNM   DFHMDF POS=(6,20),LENGTH=30,ATTRB=(ASKIP,NORM)
         DFHMDF POS=(7,5),LENGTH=12,ATTRB=(ASKIP,NORM),                X
               INITIAL='BALANCE    :'
CUSTBAL  DFHMDF POS=(7,20),LENGTH=15,ATTRB=(ASKIP,NORM)
MSG      DFHMDF POS=(23,1),LENGTH=79,ATTRB=(ASKIP,BRT)
         DFHMSD TYPE=FINAL
         END
