      * INVCOMM  - INVENTORY COMMAREA (24 BYTES)
           05  IC-ITEM-ID             PIC X(12).
           05  IC-QTY                 PIC S9(7) COMP-3.
           05  IC-RC                  PIC S9(4) COMP.
           05  IC-FUNC                PIC X(6).
