* CSD GROUP DECOGRP -- DEALER COMMISSION INQUIRY (RETIRED)
DEFINE PROGRAM(DECOINQ) GROUP(DECOGRP) LANGUAGE(COBOL)
DEFINE TRANSACTION(DECI) GROUP(DECOGRP) PROGRAM(DECOINQ)
