 /* CLMPROC - CLAIMS VALIDATION. CALLS THE COBOL EDIT ROUTINE CLMEDIT. */
 CLMPROC: PROC(PARM) OPTIONS(MAIN);
   DCL PARM CHAR(100) VARYING;
   DCL 1 CLAIM,
       2 CLM_ID       CHAR(10),
       2 CLM_AMT      FIXED DEC(9,2),
       2 CLM_STATUS   CHAR(1);
   DCL CLMEDIT ENTRY;
   CALL INIT_CLAIM;
   CALL CHECK_CLAIM;
   CALL CLMEDIT(CLAIM);
   RETURN;

 INIT_CLAIM: PROC;
   CLM_ID = '';
   CLM_AMT = 0;
 END INIT_CLAIM;

 CHECK_CLAIM: PROC;
   IF CLM_AMT > 0 THEN
     CLM_STATUS = 'A';
   ELSE RETURN;
   CALL LOG_CLAIM;
   CALL WRITE_CLAIM;
 END CHECK_CLAIM;

 LOG_CLAIM: PROC;
   PUT SKIP LIST(CLM_ID);
 END LOG_CLAIM;

 WRITE_CLAIM: PROC;
   PUT SKIP LIST(CLM_STATUS);
 END WRITE_CLAIM;
 END CLMPROC;
