* CSD GROUP CUSTGRP -- CUSTOMER INQUIRY
DEFINE PROGRAM(CUSTINQ) GROUP(CUSTGRP) LANGUAGE(COBOL)
DEFINE PROGRAM(CUSTDBIO) GROUP(CUSTGRP) LANGUAGE(COBOL)
DEFINE PROGRAM(CUSTMNU) GROUP(CUSTGRP) LANGUAGE(COBOL)
DEFINE MAPSET(CUSTMS) GROUP(CUSTGRP)
DEFINE TRANSACTION(CINQ) GROUP(CUSTGRP) PROGRAM(CUSTINQ)
DEFINE TRANSACTION(CMNU) GROUP(CUSTGRP) PROGRAM(CUSTMNU)
