//RPTMTH   JOB (MIS,0597),'MONTHLY OPS REPORT',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//HEAD     EXEC PGM=RPTHDR
//STEPLIB  DD DSN=PROD.MIS.LOADLIB,DISP=SHR
//RPTOUT   DD SYSOUT=A
