//INVDB    JOB (INVN,0100),'INVENTORY DB2 RUNSTA',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//STATS    EXEC PGM=DSNUTILB,PARM='DB2P,INVSTATS'
//SYSPRINT DD SYSOUT=*
