//GLNIGHT  JOB (GLED,0001),'LEDGER POSTING',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//POST     EXEC PGM=GLPOST
//STEPLIB  DD DSN=PROD.GLED.LOADLIB,DISP=SHR
//JRNLIN   DD DSN=PROD.GLED.JOURNAL(0),DISP=SHR
