//ACCTPRC  PROC
//*
//POST     EXEC PGM=ACCTPOST
//STEPLIB  DD DSN=PROD.ACCT.LOADLIB,DISP=SHR
//TRANIN   DD DSN=PROD.ACCT.TRANS(0),DISP=SHR
//ACCTOUT  DD DSN=PROD.ACCT.MASTER(+1),DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(5,5),RLSE),DCB=(RECFM=FB,LRECL=152)
//SYSOUT   DD SYSOUT=*
//         PEND
