* CSD GROUP INVGRP -- INVENTORY
DEFINE PROGRAM(INVUPD) GROUP(INVGRP) LANGUAGE(COBOL)
DEFINE PROGRAM(INVDB) GROUP(INVGRP) LANGUAGE(COBOL)
DEFINE TRANSACTION(IUPD) GROUP(INVGRP) PROGRAM(INVUPD)
DEFINE FILE(INVFILE) GROUP(INVGRP) DSNAME(PROD.INVN.ITEMS)
