//BILLMTH  JOB (BILL,0900),'MONTHLY BILLING',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//CALC     EXEC PGM=BILLCALC
//STEPLIB  DD DSN=PROD.BILL.LOADLIB,DISP=SHR
//BILLIN   DD DSN=PROD.BILL.MASTER(0),DISP=SHR
//BILLPRV  DD DSN=PROD.BILL.MASTER(-1),DISP=SHR
//BILLOUT  DD DSN=PROD.BILL.MASTER(+1),DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(10,5),RLSE)
//SYSOUT   DD SYSOUT=*
