      * PAYTPL   - EMPLOYEE TEMPLATE, COPY ... REPLACING ==:TAG:==
           05  :TAG:-ID               PIC X(6).
           05  :TAG:-NAME             PIC X(30).
           05  :TAG:-RATE             PIC S9(5)V99 COMP-3.
