//TAXQTR   JOB (TAXR,0601),'TAX QUARTERLY',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//CALC     EXEC PGM=TAXCALC2
//STEPLIB  DD DSN=PROD.TAXR.LOADLIB,DISP=SHR
//STEPLIB2 DD DSN=VENDOR.TAXLINK.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
