000100* RPTHDR   - REPORT HEADING LINE
000200     05  RPT-CC                 PIC X VALUE '1'.
000300     05  RPT-TITLE PIC X(40) VALUE 'DAILY ACCOUNT ACTIVITY'.
000400     05  RPT-PAGE-LIT           PIC X(6) VALUE 'PAGE '.
000500     05  RPT-PAGE               PIC ZZZ9.
