000100* RPTTOT   - REPORT MONEY TOTALS
000200     05  TOT-DEBITS             PIC S9(11)V99 COMP-3.
000300     05  TOT-CREDITS            PIC S9(11)V99 COMP-3.
