//PAYWKLY  JOB (PAYR,0700),'WEEKLY PAYROLL',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//PAY      EXEC PGM=PAYMAIN
//STEPLIB  DD DSN=PROD.PAYR.LOADLIB,DISP=SHR
//PAYOUT   DD DSN=PROD.PAYR.REGISTER(+1),DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(50,10),RLSE)
