//KØBDAG   JOB (NORD,0045),'DAGLIG RENTE',CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//RENTE    EXEC PGM=KØBREG
//STEPLIB  DD DSN=PROD.KØB.LOADLIB,DISP=SHR
//KUNDER   DD DSN=PROD.KØB.KUNDER,DISP=SHR
