//AUDLOG   PROC
//*
//LOG      EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=PROD.SHARED.AUDIT.STAGE,DISP=SHR
//SYSUT2   DD DSN=PROD.SHARED.AUDIT.LOG,DISP=(MOD,KEEP)
//         PEND
