      * ORDPARM  - ORDVAL / ORDPRICE CALL PARAMETERS
           05  PRM-FUNCTION           PIC X.
           05  PRM-RC                 PIC S9(4) COMP.
           05  PRM-MSG                PIC X(30).
