* CSD GROUP SHPGRP -- SHIPMENT INQUIRY
DEFINE PROGRAM(SHPINQ) GROUP(SHPGRP) LANGUAGE(COBOL)
DEFINE PROGRAM(SHPRATE) GROUP(SHPGRP) LANGUAGE(COBOL)
DEFINE PROGRAM(SHPMENU) GROUP(SHPGRP) LANGUAGE(COBOL)
DEFINE PROGRAM(SHPLEGA) GROUP(SHPGRP) LANGUAGE(COBOL)
DEFINE TRANSACTION(SHPI) GROUP(SHPGRP) PROGRAM(SHPINQ)
DEFINE TRANSACTION(SHPL) GROUP(SHPGRP) PROGRAM(SHPLEGA)
