000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    ACCTAUD.
000300 AUTHOR.       R HALVORSEN.
000400*------------------------------------------------------------
000500* ACCTAUD - AUDIT TRAIL FOR UPDATE CONTROL. CALLED DYNAMICALLY.
000600*------------------------------------------------------------
000700 DATA DIVISION.
000800 LINKAGE SECTION.
000900 01  LK-UPD-CONTROL.
001000     COPY UPDCTL.
001100 PROCEDURE DIVISION USING LK-UPD-CONTROL.
001200 0000-MAIN.
001300     DISPLAY 'ACCTAUD ' UPD-LAST-ACCT ' ' UPD-COUNT
001400     GOBACK.
